---
kind: type
id: T:Autodesk.Revit.DB.RenderingSettings
source: html/7ba669f3-bd38-464b-f3f7-8a0b4e513a0a.htm
---
# Autodesk.Revit.DB.RenderingSettings

Represents the rendering settings for a 3d view.

## Syntax (C#)
```csharp
public class RenderingSettings : IDisposable
```